def e1():
    x=input('Введите страну: ')
    stran={
        "Россия" : "Москва",
        "Италия" : "Рим",
        "Франция" : "Париж",
        "Финляндия" : "Хельсинки"
    }
    print("a", countries)
    print("b", countries[x])
    print("c", sorted(countries))

def e2():
    ochki={
        1 : ['А','В','Е','И','Н','О','Р','С','Т'],
        2 : ['Д','К','Л','М','П','У'],
        3 : ['Б','Г','Ё','Ь','Я'],
        4 : ['Й','Ы'],
        5 : ['Ж','З','Х','Ц','Ч'],
        8 : ['Ш','Э','Ю',],
        10 : ['Ф','Щ','Ъ',]
    }
    x = input("Введите слово")
    x=list(x)
    d=0
    for i in x:
        for k in ochki:
            if i in ochki[k]:
                d+=k
    print(d)

e2()
